In [1]:
import pandas as pd
# pandas는 데이터 분석하는 모듈

In [3]:
carstocks = pd.read_csv("data/car_stocks.csv", low_memory=False)

In [4]:
carstocks["Close"].mean()

79.83897420512822

In [5]:
# carstocks[carstocks["Symbol"]=="RIVN"].Close.mean()
carstocks[carstocks["Symbol"]=="RIVN"]["Close"].mean()
carstocks[carstocks["Symbol"]=="LCID"]["Close"].mean()
carstocks[carstocks["Symbol"]=="GM"]["Close"].mean()

62.16461546153845

In [6]:
carstocks.groupby("Symbol")["Close"].mean()
# groupby 그룹바이를 이용해서 모든 평균을 구한다.

Symbol
GM       62.164615
LCID     49.829231
RIVN    127.523077
Name: Close, dtype: float64

In [15]:
t = pd.read_csv("data/titanic.csv", low_memory=False)
t
# 타이타닉 데이터 불러오기

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,?,S,?,?,?

In [30]:
df = t[["pclass","survived","sex","age"]]
df

      pclass  survived     sex     age
0          1         1  female      29
1          1         1    male  0.9167
2          1         0  female       2
3          1         0    male      30
4          1         0  female      25
...      ...       ...     ...     ...
1304       3         0  female    14.5
1305       3         0  female       ?
1306       3         0    male    26.5
1307       3         0    male      27
1308       3         0    male      29

[1309 rows x 4 columns]

In [34]:
gbo = df.groupby(by="sex")
gbo

### Datatype : Boolean
### False. True.
survived는 0과 1로 이루어져있다.

In [37]:
gbo.get_group("male")
# get_group 은 컬럼안에 있는 값만 불러오는 것

      pclass  survived   sex     age
1          1         1  male  0.9167
3          1         0  male      30
5          1         1  male      48
7          1         0  male      39
9          1         0  male      71
...      ...       ...   ...     ...
1302       3         0  male       ?
1303       3         0  male       ?
1306       3         0  male    26.5
1307       3         0  male      27
1308       3         0  male      29

[843 rows x 4 columns]

In [110]:
t['age'] = t["age"].replace(['?'], [None]).astype('float')
# 타이타닉의 age 컬럼 안에 있는 "?"을 None, 즉 데이터 없음으로 하고, float 형의
# 데어터 타입으로 바꿔줌.

In [108]:
t.groupby('pclass')['age'].mean()

pclass
1    39.159918
2    29.506705
3    24.816367
Name: age, dtype: float64

In [111]:
t.groupby('sex')['survived'].mean()

sex
female    0.727468
male      0.190985
Name: survived, dtype: float64